Revit 2027 API
RebarSpliceRules.MaximumBarLength Property
 Identifies the maximum bar length. The default value is 12 meters if the document units are in Metric System, or 40 feet if the units are in Imperial System.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MaximumBarLength { get; set; }
Public Property MaximumBarLength As Double
	Get
	Set
public:
property double MaximumBarLength {
	double get ();
	void set (double value);
}
member MaximumBarLength : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The maximum bar length should be greater or almost equal to the minimum bar length.
See Also
Reference
RebarSpliceRules Class
Autodesk.Revit.DB.Structure Namespace